#학번 2023218055
#이름 사서연

# # print('2023218055 전자컴퓨터 공학과 사서연')
# print('************문제 1번**********************')
# a=int(input("n을 입력하시오 :"))
#
# for i in range(a):
#     for j in range(i<a):
#         if(i>0):
#             print(i,j)
#
#
#
#         else:
#             print('0')
# print('************문제 2번**********************')
#
# b=int(input("정수를 여러개 입력하시오:"))
# for i range(b):
#     b=list[i];
#
# max(b[i])
# min(b[i])
#
# print("평균값은 ",)
# print("최댓값은 ",max(i))
# print("최솟값은 ",min(i))
print('************문제 3번**********************')
a=[2,3,4,5,6]
b=[]
for i in range(a):
    b[i]=a[i-4]
    i=i+i;
print("a =",a)
print("rev_a =",b)
print('************문제 4번**********************')
x=int(input("범위의 시작 정수:"))
y=int(input("범위의 마지막 정수:"))
print("2에서 4까지의 정수들의 최소 공배수는:")
print('************문제 5번**********************')
print('************문제 6번**********************')
s_list=['abc','bcd','abc']